# SetObjectVariablePoint

## Description
Sets the value of a Vectorworks object property. Used with properties requiring a 2D or 3D point value.&lt;BR&gt;
&lt;BR&gt;
For specific object selector index values, see the Appendix.

```pascal
FUNCTION SetObjectVariablePoint(
				h     : HANDLE;
				index : INTEGER;
				p     : REAL) : BOOLEAN;
```

```python

def vs.SetObjectVariablePoint(h, index, p):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|
|index|INTEGER|Object property index.|
|p|REAL|The object variable data point.|

## See Also
VS Functions:
GetObjectVariablePoint| GetObjectVariableBoolean| SetObjectVariableBoolean| GetObjectVariableHandle| SetObjectVariableHandle| GetObjectVariableInt| SetObjectVariableInt| GetObjectVariableLongInt| SetObjectVariableLongInt| GetObjectVariableReal| SetObjectVariableReal| GetObjectVariableString| SetObjectVariableString

## Version
Availability: from Vectorworks 2011
## Category
* Object Info